#+EXPORT_FILE_NAME: README

****** Notes
#+BEGIN_SRC emacs-lisp
(defun my/generate-org-note-name ()
  (setq my-org-note--name (read-string "Name: "))
  (expand-file-name (format "%s.org" my-org-note--name) "~/org/notes/"))

(after! org (add-to-list 'org-capture-templates
                         '("n" "New Note" plain (file my/generate-org-note-name)
                           "%(format \"#+TITLE: %s\n\" my-org-note--name)
%?")))
#+END_SRC

#+RESULTS:
| x | Time Tracker | entry | (file+olp+datetree ~/org/workload/timetracking.org) | * [%\1] %\7 for %\5 |

